#!/usr/bin/env bash

printf "Lab_1
Использование: ./main.sh [параметры] [аргументы]
Параметры:
calc или -c {sum | sub | mul | div}
      sum \$num1 \$num2 - Выводит сумму двух чисел
      sub \$num1 \$num2 - Выводит разность двух чисел
      mul \$num1 \$num2 - Выводит произведение двух чисел
      div \$num1 \$num2 - Выводит частное двух чисел
search или -s ДИРЕКТОРИЯ ПАТТЕРН
      Выводит рекурсивно все файлы удовлетворяющие паттерну в указанной директории
reverse или -r ИСТОЧНИК НАЗНАЧЕНИЕ
      Записывает в обратном порядке данные из ИСТОЧНИКа в НАЗНАЧЕНИЕ
strlen или -n <строка>
      Выводит количество символов в строке
log или -l
      Выводит отредактированное содержимое /var/log/anaconda/X.log
exit или -e [код возврата]
      Завершает работу с заданным кодом возврата или 0
interactive или -i
      Запускает приложение в интерактивном режиме
help или -h
      Выводит это сообщение
"
