#include <stdio.h>
#include <math.h>

int main(void) {
	int a, b;
	scanf("%x", &a); // Задание 1 - Ввод числа в 16 системе
	printf("%o\n", a); // Задание 2 - Вывод числа в 8 системе
	printf("%x", a); // Задание 3 - Вывод числа в 16 системе
	printf(" %x\n", a >> 4); // Задание 3 - Вывод числа в 16 системе со сдвигом вправо на 4 бита
	printf("%x", a); // Задание 4 - Вывод числа в 16 системе
	printf(" %x\n", ~a); // Задание 4 - Вывод числа в 16 системе с приминением побитового отрицания
    scanf("%x", &b); // Задание 5 - Ввод числа в 16 системе
    printf("%x", a^b); // Задание 5 - Вывод результата от исключающего или в 16 системе


	return 0;
}